{"486d2fbd-20250411220251": {"id": "486d2fbd-20250411220251", "title": "Fish Mollee", "description": "Fish Mollee is a flavorful and mild spiced fish curry, hailing from the southern parts of India. It is made with a coconut milk base and laced with spices, offering a delicately balanced flavor that pairs beautifully with rice or bread.", "youtubeUrl": "https://youtube.com/watch?v=9qXZ_aous-Y", "ingredients": ["Fish (cut into pieces)", "1 tsp Turmeric powder", "Salt to taste", "3-4 Tbsp Oil", "4 Cloves", "6 Green cardamoms", "3 inch Cinnamon stick", "1.5 cups Coconut milk", "1 tsp Mustard seeds", "1 cup Thick tamarind juice", "Few curry leaves"], "instructions": ["Mix the fish pieces with turmeric powder and salt, and set aside for an hour.", "Heat oil in a pan and fry the marinated fish pieces for approximately 3 minutes on each side, or until they are well cooked.", "In the same oil, add cloves, green cardamoms, and cinnamon stick, and sauté for 10-15 seconds.", "Add mustard seeds and allow them to splutter.", "Pour in the thick tamarind juice and add a few curry leaves, then cook until the raw smell disappears.", "Gently add the fried fish pieces back into the pan.", "Pour in the coconut milk and stir carefully to avoid breaking the fish pieces.", "Cook on a medium flame until the curry starts to boil. Then, reduce to a low flame and cook until the curry reaches a slightly thick consistency.", "Adjust the salt to taste, and remove from flame once done."], "tips": ["Ensure the fish pieces are dried well before frying to get a good sear on them.", "Fry the fish on medium flame to avoid burning and to ensure it is cooked evenly.", "You can adjust the quantity of coconut milk based on your preference for the curry's thickness."], "video_title": "ഫിഷ് മോളി  | Fish Molly - Kerala Style Recipe | Fish Molee - Easy Malayalam Recipe | Meen Moilee", "thumbnail": "https://i.ytimg.com/vi_webp/9qXZ_aous-Y/maxresdefault.webp", "created_at": "2025-04-11T22:02:51.076529"}}